# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

lst = [input()]
lst2 = list(map(int, input().split()))
lst3 = list(map(int, input().split()))
count = []
for i in lst2:
    for j in lst3:
        if i == j:
            count.append(i)
print(*sorted(set(count)))
